app/Controllers/AuthController.php

                session()->set('role',$user_info['Role']);
                //create log
                $data = ['Date'=>date('Y-m-d H:i:s a'),'Activity'=>'Logged On','accountID'=>$user_info['accountID']];
                $logModel->save($data);
---
INSERT INTO `tbl_log` (`Date`, `Activity`, `accountID`) VALUES ('2025-05-26 14:56:39 pm', 'Logged On', '1')

    public function logout()
    {
        date_default_timezone_set('Asia/Manila');
        $logModel = new \App\Models\logModel();
        //create log
        $data = ['Date'=>date('Y-m-d H:i:s a'),'Activity'=>'Logged Out','accountID'=>session()->get('loggedUser')];
        $logModel->save($data);
---
INSERT INTO `tbl_log` (`Date`, `Activity`, `accountID`) VALUES ('2025-05-22 16:46:35 pm', 'Logged Out', '7')