app/Controllers/Compute.php

SELECT IFNULL(SUM(Amount), 0)total
FROM `tbl_list`
WHERE `Status` = 0
---
    public function unsettle()
    {
        $builder = $this->db->table('tbl_list');
        $builder->select('IFNULL(SUM(Amount),0)total');
        $builder->WHERE('Status',0);
        $data = $builder->get()->getRow();

SELECT IFNULL(SUM(Amount), 0)total
FROM `tbl_list`
WHERE `Status` = 1
AND `DateCreated` = '2025-03-12'
---
    public function settle()
    {
        $builder = $this->db->table('tbl_list');
        $builder->select('IFNULL(SUM(Amount),0)total');
        $builder->WHERE('Status',1)->WHERE('DateCreated',date('Y-m-d'));
        $data = $builder->get()->getRow();

SELECT IFNULL(NewBal, 0)total
FROM `tblbalance`
ORDER BY `balanceID` DESC
 LIMIT 1
---
    public function cashOnHand()
    {
        $builder = $this->db->table('tblbalance');
        $builder->select('IFNULL(NewBal,0)total');
        $builder->orderBy('balanceID','DESC')->limit(1);
        $data = $builder->get()->getRow();