app/Controllers/FileController.php

    public function forReview()
    {
        $approveModel = new \App\Models\approveModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        $totalRecords = $approveModel->countAllResults();
        //request
        $builder = $this->db->table('tblapprove a');
        $builder->select('a.DateReceived,a.DateApproved,a.Status,a.approveID,b.requestID,b.Fullname,b.Department,b.Amount,b.Purpose,b.File');
        $builder->join('tblrequest b','b.requestID=a.requestID','LEFT');
        $builder->WHERE('a.accountID',session()->get('loggedUser'));
---
SELECT `a`.`approveID`, `b`.*
FROM `tblapprove` `a`
LEFT JOIN `tblrequest` `b` ON `b`.`requestID`=`a`.`requestID`
WHERE `a`.`approveID` = '1'

    public function release()
    {
        $monitorModel = new \App\Models\monitorModel();
        $balanceModel = new \App\Models\balanceModel();
        $val = $this->request->getPost('value');
        $data = ['requestID'=>$val,
                'DateTagged'=>date('Y-m-d'),
                'Status'=>1,
                'accountID'=>session()->get('loggedUser')];
        $monitorModel->save($data);
        //auto deduct the amount to the cash on hand
        $builder = $this->db->table('tblbalance');
        $builder->select('NewBal');
        $builder->orderBy('balanceID','DESC')->limit(1);
        $balance = $builder->get()->getRow();
---
SELECT `NewBal`
FROM `tblbalance`
ORDER BY `balanceID` DESC
 LIMIT 1