app/Controllers/FileController.php

SELECT `a`.`DateReceived`, `a`.`DateApproved`, `a`.`Status`, `a`.`approveID`, `b`.`requestID`, `b`.`Fullname`, `b`.`Department`, `b`.`Amount`, `b`.`Purpose`, `b`.`File`
FROM `tblapprove` `a`
LEFT JOIN `tblrequest` `b` ON `b`.`requestID`=`a`.`requestID`
WHERE `a`.`accountID` = '3'
GROUP BY `a`.`approveID`
---
    public function forReview()
    {
        $approveModel = new \App\Models\approveModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        $totalRecords = $approveModel->countAllResults();
        //request
        $builder = $this->db->table('tblapprove a');
        $builder->select('a.DateReceived,a.DateApproved,a.Status,a.approveID,b.requestID,b.Fullname,b.Department,b.Amount,b.Purpose,b.File');
        $builder->join('tblrequest b','b.requestID=a.requestID','LEFT');
        $builder->WHERE('a.accountID',session()->get('loggedUser'));