app/Controllers/Home.php

SELECT *
FROM `tblaccount`
---
    public function fetchAssign()
    {
        $assignModel = new \App\Models\assignModel();
        //assigned
        $builder = $this->db->table('tblassign a');
        $builder->select('a.assignID,a.DateCreated,a.Role,b.Fullname,b.Username');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $builder->groupBy('a.assignID');
        $records = $builder->get()->getResult();