app/Controllers/Home.php

    public function newRequest()
    {
        $title = "New PCF";
        $accountModel = new \App\Models\accountModel();
        $account = $accountModel->WHERE('Role','Department Head')->findAll();
        //department
        $departmentModel = new \App\Models\departmentModel();
        $department = $departmentModel->findAll();
        //check liquidation records
        $fileModel = new \App\Models\fileModel();
        $checkFiles = $fileModel->WHERE('status',5)->WHERE('accountID',session()->get('loggedUser'))->findAll();
        //liquidation checker
        $listModel = new \App\Models\listModel();
        $lists = $listModel->WHERE('accountID',session()->get('loggedUser'))->findAll();
---
SELECT *
FROM `tbl_list`
WHERE `accountID` = '1'