app/Controllers/Home.php

    public function configure()
    {
        if(session()->get('role')=="Admin")
        {
            $title = "PCF Settings";
            //logs
            $builder = $this->db->table('tbl_log a');
            $builder->select('a.*,b.Fullname');
            $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
            $builder->groupBy('a.logID');
            $log = $builder->get()->getResult();
---
SELECT *
FROM `tblaccount`

    public function fetchAssign()
    {
        $assignModel = new \App\Models\assignModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        //assigned
        $builder = $this->db->table('tblassign a');
        $builder->select('a.assignID,a.DateCreated,a.Role,b.Fullname,b.Username');
        $builder->join('tblaccount b','b.accountID=a.accountID','LEFT');
        $builder->WHERE('a.accountID<>',0);
        $builder->groupBy('a.assignID');
        if ($searchTerm) {
            // Add a LIKE condition to filter based on school name or address or any other column you wish to search
            $builder->groupStart()
                    ->like('a.DateCreated', $searchTerm)
                    ->orLike('a.Role', $searchTerm)
                    ->orLike('b.Fullname', $searchTerm)
                    ->orLike('b.Username', $searchTerm)
                    ->groupEnd();
        }
        $records = $builder->get()->getResult();
---
SELECT *
FROM `tblaccount`

    public function saveUser()
    {
        $accountModel = new \App\Models\accountModel();
        $validation = $this->validate([
            'csrf_test_name'=>'required',
            'fullname'=>'required|is_unique[tblaccount.Fullname]',
            'username'=>'required|is_unique[tblaccount.Username]',
            'role'=>'required'
        ]);

        if(!$validation)
        {
            return $this->response->SetJSON(['error' => $this->validator->getErrors()]);
        }
        else
        {
            $defaultPassword = Hash::make("Fastcat_01");
            $data = ['Username'=>$this->request->getPost('username'),
                    'Password'=>$defaultPassword,
                    'Fullname'=>$this->request->getPost('fullname'),
                    'Role'=>$this->request->getPost('role'),
                    'Status'=>1,
                    'DateCreated'=>date('Y-m-d')];
            $accountModel->save($data);

            date_default_timezone_set('Asia/Manila');
            $logModel = new \App\Models\logModel();
            //create log
            $data = ['Date'=>date('Y-m-d H:i:s a'),'Activity'=>'Added new user account','accountID'=>session()->get('loggedUser')];
            $logModel->save($data);
---
INSERT INTO `tbl_log` (`Date`, `Activity`, `accountID`) VALUES ('2025-03-19 18:22:45 pm', 'Added new user account', '1')